Diacritical.Languages = {
    French: {
        Uppercase: [
            '\u00C0', // À
            '\u00C2', // Â
            '\u00C4', // Ä
            '\u00C7', // Ç
            '\u00C8', // È
            '\u00C9', // É
            '\u00CA', // Ê
            '\u00CB', // Ë
            '\u00CE', // Î
            '\u00CF', // Ï
            '\u00D4', // Ô
            '\u00D6', // Ö
            '\u00D9', // Ù
            '\u00DB', // Û
            '\u00DC', // Ü
            '\u00C6', // Æ
            '\u0152'  // Œ
        ],
        
        Lowercase: [
            '\u00E0', // à
            '\u00E2', // â
            '\u00E4', // ä
            '\u00E7', // ç
            '\u00E8', // è
            '\u00E9', // é
            '\u00EA', // ê
            '\u00EB', // ë
            '\u00EE', // î
            '\u00EF', // ï
            '\u00F4', // ô
            '\u00F6', // ö
            '\u00F9', // ù
            '\u00FB', // û
            '\u00FC', // ü
            '\u00E6', // æ
            '\u0153'  // œ
        ]
    },
    
    German: {
        Uppercase: [
            '\u00C4', // Ä
            '\u00D6', // Ö
            '\u00DC', // Ü
            '\u1E9E'  // ẞ
        ],
        
        Lowercase: [
            '\u00E4', // ä
            '\u00F6', // ö
            '\u00FC', // ü
            '\u00DF'  // ß
        ]
    },
    
    Spanish: {
        Uppercase: [
            '\u00C1', // Á
            '\u00C9', // É
            '\u00CD', // Í
            '\u00D1', // Ñ
            '\u00D3', // Ó
            '\u00DA', // Ú
            '\u00DC'  // Ü
        ],
        
        Lowercase: [
            '\u00E1', // á
            '\u00E9', // é
            '\u00ED', // í
            '\u00F1', // ñ
            '\u00F3', // ó
            '\u00FA', // ú
            '\u00FC'  // ü
        ]
    }
};
